// Напишіть скрипт перевірки кількості товарів на складі. Є змінні total
// (кількість товарів на складі) і ordered (кількість замовленого товару).

// Зрівняти ці значення і за результатами вивести:

// Якщо в замовленні вказано число, що перевищує кількість товарів на складі, то
// виведіть повідомлення "На складі недостатня кількість товару!". В другому
// випадку виведіть повідомлення "Замовлення оформлено". Перевірте працездатність
// коду з різними значеннями змінної ordered, наприклад 20, 80 і 130.

const total = 100;
const ordered = 50;

if (ordered > total){
console.log("На складі недостатня кількість товару!")
}

else 
    console.log("Замовлення оформлено");


const total1 = 100;
const ordered1 = 130;
    
if (ordered1 > total1){
 console.log("На складі недостатня кількість товару!")
 }
else 
console.log("Замовлення оформлено");
    