// Напишіть скрипт, що імітує авторизацію адміністратора в панелі
// управління.

// Є змінна, message в якій буде записано повідомлення про результат. При
// завантаженні сторінки у користувача запитується пароль через prompt:

// Якщо натиснули Cancel, записати в message рядок 'Операцію скасовано!' У
// протилежному випадку, якщо введено пароль, який відповідає зі значенням
// константи ADMIN_PASSWORD, запишіть у message 'Ласкаво просимо!' У протилежному
// випадку, якщо ні одна з попередніх умов не виконалася, запишіть у message
// 'Доступ заборонено, невірний пароль!' Після всіх перевірок вивести в alert
// значення змінної message.

const ADMIN_PASSWORD = 'jqueryismyjam'; 
let message;

const userPassword = prompt('Введіть пароль для доступу до панелі управління:');
if (userPassword === null) {
    message = 'Операцію скасовано!';
}
else if (userPassword === ADMIN_PASSWORD) {
    message = 'Ласкаво просимо!';
}
else {
    message = 'Доступ заборонено, невірний пароль!';
  }
alert(message);   
